In [4]:
import pandas as pd

# Load the dataset
df = pd.read_csv('store_sales_dirty_data.csv')

# Preview the first few rows
df.head()

   ID Product Name   Category  Quantity  Unit Price   Sale Date    Store
0   1         Milk  Household       NaN         NaN  2023-07-13  Store B
1   2         Eggs        NaN      10.0         2.0  2023-07-10  Store A
2   3          NaN      Dairy       NaN        -2.5  01.07.2023  Store A
3   4       Apples    Produce      10.0         NaN  02.07.2023  Store A
4   5         Milk      Dairy       3.0         1.5         NaN  Store C

In [5]:
df.info()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            30 non-null     int64
 1   Product Name  27 non-null     object
 2   Category      24 non-null     object
 3   Quantity      21 non-null     float64
 4   Unit Price    20 non-null     float64
 5   Sale Date     22 non-null     object
 6   Store         30 non-null     object
dtypes: float64(2), int64(1), object(4)
memory usage: 1.8+ KB

,ID,Product Name,Category,Quantity,Unit Price,Sale Date,Store
count,30.000000,27,24,21.000000,20.000000,22,30
unique,NaN,7,5,NaN,NaN,18,3
top,NaN,Eggs,Dairy,NaN,NaN,2023/07/15,Store A
freq,NaN,6,8,NaN,NaN,4,15
mean,15.500000,NaN,NaN,6.142857,1.725000,NaN,NaN
std,8.803408,NaN,NaN,4.003570,1.875921,NaN,NaN
min,1.000000,NaN,NaN,0.000000,-2.500000,NaN,NaN
25%,8.250000,NaN,NaN,3.000000,1.500000,NaN,NaN
50%,15.500000,NaN,NaN,5.000000,1.750000,NaN,NaN
75%,22.750000,NaN,NaN,10.000000,3.750000,NaN,NaN
max,30.000000,NaN,NaN,10.000000,3.750000,NaN,NaN

In [ ]:
import pandas as pd


df = pd.read_csv("store_sales_dirty_data.csv", encoding="utf-8")


print(df.isnull().sum())

ID               0
Product Name     3
Category         6
Quantity         9
Unit Price      10
Sale Date        8
Store            0
dtype: int64

In [9]:
df["Sale Date"] = pd.to_datetime(df["Sale Date"], errors="coerce")


df["Quantity"] = pd.to_numeric(df["Quantity"], errors="coerce")
df["Unit Price"] = pd.to_numeric(df["Unit Price"], errors="coerce")

print(df.dtypes)

ID                       int64
Product Name            object
Category                object
Quantity               float64
Unit Price             float64
Sale Date       datetime64[ns]
Store                   object
dtype: object

In [11]:
df = df[(df["Quantity"] > 0) & (df["Unit Price"] > 0)]


print(df[["Quantity", "Unit Price"]].describe())

        Quantity  Unit Price
count  11.000000   11.000000
mean    6.636364    2.613636
std     4.006812    1.103198
min     1.000000    1.500000
25%     3.000000    1.500000
50%    10.000000    2.000000
75%    10.000000    3.750000
max    10.000000    3.750000

In [ ]:
df["Total Sales"] = df["Quantity"] * df["Unit Price"]

print(df.head())

    ID Product Name   Category  Quantity  Unit Price  Sale Date    Store  \
1    2         Eggs        NaN      10.0        2.00 2023-07-10  Store A
4    5         Milk      Dairy       3.0        1.50        NaT  Store C
5    6        Bread     Bakery       5.0        3.75        NaT  Store C
6    7         Eggs        NaN      10.0        1.50        NaT  Store B
10  11        Bread  Household       1.0        3.75 2023-07-08  Store A

    Total Sales
1         20.00
4          4.50
5         18.75
6         15.00
10         3.75

In [14]:
df.info()
df.head()

# Save cleaned file
df.to_csv("store_sales_dirty_data.csv", index=False)

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, 1 to 27
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            11 non-null     int64
 1   Product Name  10 non-null     object
 2   Category      8 non-null      object
 3   Quantity      11 non-null     float64
 4   Unit Price    11 non-null     float64
 5   Sale Date     2 non-null      datetime64[ns]
 6   Store         11 non-null     object
 7   Total Sales   11 non-null     float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(3)
memory usage: 792.0+ bytes

In [15]:
df['Total Sale'] = df['Quantity'] * df['Unit Price']
df.head()

,ID,Product Name,Category,Quantity,Unit Price,Sale Date,Store,Total Sales,Total Sale
1,2,Eggs,NaN,10.0,2.00,2023-07-10,Store A,20.00,20.00
4,5,Milk,Dairy,3.0,1.50,NaT,Store C,4.50,4.50
5,6,Bread,Bakery,5.0,3.75,NaT,Store C,18.75,18.75
6,7,Eggs,NaN,10.0,1.50,NaT,Store B,15.00,15.00
10,11,Bread,Household,1.0,3.75,2023-07-08,Store A,3.75,3.75